#include <stdio.h>
#include "func.h"
#include "various.h"

/*******************************************************************************
 *此函数在屏幕中间打印出圆点
*******************************************************************************/

/*int main(int argc, const char *argv[])
{
	init_data();
	int i,j;
	for (i = 0; i < 100; i++) 
	{
		for (j = 0; j < 100; j++) 
		{
			fb_one_pixel(j+500,i+300,0x00ff0000);//////利用二维实现此函数并把很多点打印在屏幕中间
		}
	}
	return 0;
}*/

/******************************************************************************
 *此主函数可以在屏幕上打印出直线
*******************************************************************************/

/*int main(int argc, const char *argv[])
{
	init_data();
	fb_line(0,0,fb_v.w-1,fb_v.h-1,0x0000ff00);///////划出直线

	fb_line(fb_v.w-1,0,0,fb_v.h-1,0x0000ff00);
	return 0;
}*/
/******************************************************************************
 *此函数用来在文本屏幕下打印出圆形  solid为实心圆   hollow为空心圆
 ******************************************************************************/

/*int main(int argc, const char *argv[])
{
	init_data();
	fb_hollow_circle(500,300,200,0x004578900);
	fb_solid_circle(500,300,100,0x000000ff);
	fb_hollow_circle(500,300,150,0x00225588);
	return 0;
}*/


/******************************************************************************
 *此主函数用来在屏幕上打印出五子棋的棋盘
*******************************************************************************/


int main(int argc, const char *argv[])
{
	init_data();
	printf_board();
	return 0;
}

